15036829975/51_STM32_CODE/stm32Project/6-8编码器接口测速/Hardware/Encoder.c
#include "stm32f10x.h"                  // Device header

void Encoder_Init(void)
{
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
		
		GPIO_InitTypeDef GPIO_Initstructure;
		GPIO_Initstructure.GPIO_Mode= GPIO_Mode_IPU;
		GPIO_Initstructure.GPIO_Pin= GPIO_Pin_6 | GPIO_Pin_7;
		GPIO_Initstructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_Init(GPIOA,&GPIO_Initstructure);  //初始化GPIO
	
	
		TIM_InternalClockConfig(TIM3);//选择时钟
	
	
		TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
		TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1;
		TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up;
		TIM_TimeBaseInitStructure.TIM_Period= 65536-1;      //   ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler= 1-1;    //   PSC 不分频
		TIM_TimeBaseInitStructure.TIM_RepetitionCounter=0;
		TIM_TimeBaseInit(TIM3,&TIM_TimeBaseInitStructure);

		TIM_ICInitTypeDef	TIM_ICInitStructure;
		TIM_ICStructInit(&TIM_ICInitStructure);
		TIM_ICInitStructure.TIM_Channel=TIM_Channel_1;
		TIM_ICInitStructure.TIM_ICFilter=0xF;
	
		TIM_ICInit(TIM3,&TIM_ICInitStructure);
		
		TIM_ICInitStructure.TIM_Channel=TIM_Channel_2;
		TIM_ICInitStructure.TIM_ICFilter=0xF;
		
		TIM_ICInit(TIM3,&TIM_ICInitStructure);

		TIM_EncoderInterfaceConfig(TIM3,TIM_EncoderMode_TI12,TIM_ICPolarity_Rising,TIM_ICPolarity_Rising);
		
		TIM_Cmd(TIM3,ENABLE);
		
}
int16_t Encoder_Get(void)
{
	
	int16_t Temp;
	Temp = TIM_GetCounter(TIM3);
	TIM_SetCounter(TIM3, 0);
	return Temp;
	
}
